/******************** (C) COPYRIGHT 2022 << VECTOR >> *******************************
 * File Name          : HW_TIMERS.c
 * Author             : Electronic Devices Application Team
 * Version            : V1.01
 * Date               : 11/2022
 * Description        : Управление системными таймерами
 ********************************************************************************/

/* Includes ------------------------------------------------------------------*/

#include "HW_Globals.h"
#include "HW_TIMERS.h"
#include "main.h"
#include "stm32l1xx_hal_gpio.h"

/* Private includes ----------------------------------------------------------*/
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/

/* External variables --------------------------------------------------------*/



//* Принудительный сброс внешнего аппаратоного сторожевого таймера (микросхема TPL5010, задействован её вход "DONE")
/** ——————————————————————————————————————————————————————————————————————————————————————————————————————————————
  @brief    ResetExtWDT - сброс внешнего аппаратоного сторожевого таймера (микросхема TPL5010)

  @param    Без параметров
  @retval 	Ничего не возвращает

  @example
  
    ResetExtWDT();

  —————————————————————————————————————————————————————————————————————————————————————————————————————————————— */
void ResetExtWDT (void)
{
//  Выдача на вход сброса таймера импульса длиной 1 мс
  HAL_GPIO_WritePin (WDT_DONE_GPIO_Port, WDT_DONE_Pin, GPIO_PIN_SET);
  HAL_Delay(1);
  HAL_GPIO_WritePin (WDT_DONE_GPIO_Port, WDT_DONE_Pin, GPIO_PIN_RESET);
}


/*********************************** END OF FILE ************************************/
